### Limpieza conjunta

In [1]:
#IMPORTANDO LIBRERIAS NECESARIAS
import numpy as np
import pandas as pd
pd.set_option('display.max_columns', None)

In [2]:
df_limpio = pd.read_csv("hr_raw_data.csv", index_col=0)
df_limpio.head()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,"16280,83$","42330,17$",7,Y,No,13,"3,0",3,Full Time,0,NaN,5,"3,0",20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,"43331,17$",0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,"41669,33$",1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,"14307,50$","37199,50$",3,Y,NaN,19,"3,0",2,Full Time,2,NaN,2,NaN,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,"12783,92$","33238,20$",2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

### Columnas Gabi

In [3]:
#Vamos a limpiar la columna age
df_limpio['age'] = df_limpio['age'].str.strip().str.lower()

In [4]:
def calcular_edad(datebirth):
    año_actual = 2025
    return año_actual - datebirth

In [5]:
df_limpio['age'] = df_limpio['datebirth'].apply(calcular_edad).astype(int)

In [6]:
df_limpio["age"].unique()

array([53, 54, 44, 49, 48, 50, 61, 43, 58, 40, 57, 42, 60, 37, 47, 35, 38,
       36, 55, 45, 62, 34, 39, 51, 41, 52, 46, 32, 31, 33, 56, 59, 29, 30,
       28, 27, 26, 25, 24, 23, 22, 21, 20])

In [7]:
porcentaje_nulos_age = df_limpio['age'].isnull().mean() * 100
print(f"Porcentaje de nulos en 'age': {porcentaje_nulos_age:.2f}%")

Porcentaje de nulos en 'age': 0.00%

In [8]:
conteo_unicos = df_limpio['age'].nunique()
print(f"Número de valores únicos en 'age': {conteo_unicos}")

Número de valores únicos en 'age': 43

In [9]:
df_limpio["age"].unique()

array([53, 54, 44, 49, 48, 50, 61, 43, 58, 40, 57, 42, 60, 37, 47, 35, 38,
       36, 55, 45, 62, 34, 39, 51, 41, 52, 46, 32, 31, 33, 56, 59, 29, 30,
       28, 27, 26, 25, 24, 23, 22, 21, 20])

In [10]:
df_limpio["distancefromhome"].unique()

array([  6,   1,   4,   2,   3,  22,  25,   9,   7,  23,  10,  12,  14,
       -13,  15,   8, -42,  28, -37,   5,  16, -35,  26, -26,  24,  29,
       -25,  17,  21, -18, -10, -30, -27,  20, -31, -29, -39,  18, -21,
       -15,  11,  13, -14,  19, -33, -34, -46, -36, -19,  27, -12, -23,
       -45, -28, -47, -32, -24, -16, -22, -41, -49, -11, -48, -38, -20,
       -17, -43, -40, -44])

In [11]:
df_limpio["distancefromhome"] = df_limpio["distancefromhome"].abs()

In [12]:
df_limpio["distancefromhome"].unique()

array([ 6,  1,  4,  2,  3, 22, 25,  9,  7, 23, 10, 12, 14, 13, 15,  8, 42,
       28, 37,  5, 16, 35, 26, 24, 29, 17, 21, 18, 30, 27, 20, 31, 39, 11,
       19, 33, 34, 46, 36, 45, 47, 32, 41, 49, 48, 38, 43, 40, 44])

In [13]:
df_limpio.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'over18', 'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

In [14]:
# Quitamos employeecount porque el valor es 1 y no aporta información
df_limpio = df_limpio.drop(columns=["employeecount"])

In [15]:
df_limpio.columns #comprobamos que ya no está

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement',
       'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus',
       'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'over18',
       'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

### Columnas Irene

In [16]:
'''¿borramos hourlyrate?'''

'¿borramos hourlyrate?'

In [17]:
def minusculas(celda): #quitemos las mayúculas a jobrole
  try:
    return celda.lower()
  except:
    return celda

In [18]:
df_limpio['jobrole'] = df_limpio['jobrole'].apply(minusculas)

In [19]:
df_limpio['jobrole'] = df_limpio['jobrole'].str.strip()

In [20]:
df_limpio['jobrole'].unique()

array(['research director', 'manager', 'sales executive',
       'manufacturing director', 'research scientist',
       'healthcare representative', 'laboratory technician',
       'sales representative', 'human resources'], dtype=object)

In [21]:
df_limpio['maritalstatus'] = df_limpio['maritalstatus'].apply(minusculas)

In [22]:
df_limpio['maritalstatus'] = df_limpio['maritalstatus'].replace('marreid', 'married')

In [23]:
df_limpio['maritalstatus'].unique() #aplicamos minúsculas

array([nan, 'married', 'divorced', 'single'], dtype=object)

In [24]:
df_limpio['gender'].replace({0: 'Male', 1: 'Female'}, inplace=True)

/tmp/ipykernel_1535035/2639878342.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_limpio['gender'].replace({0: 'Male', 1: 'Female'}, inplace=True)

In [25]:
df_limpio['gender'].unique()

array(['Male', 'Female'], dtype=object)

In [26]:
df_limpio['environmentsatisfaction'] = np.where(
  df_limpio['environmentsatisfaction'].between(10, 49), # Valores de 2 dígitos
  df_limpio['environmentsatisfaction'] // 10,      # División entera (primer dígito)
  df_limpio['environmentsatisfaction']         # Valores 1-4 se mantienen
)

In [27]:
df_limpio['environmentsatisfaction'].unique()

array([1, 3, 4, 2])

In [28]:
df_limpio['environmentsatisfaction'].value_counts()

environmentsatisfaction
4    509
3    490
1    341
2    338
Name: count, dtype: int64

In [29]:
df_limpio['monthlyincome'] = df_limpio['monthlyincome'].str.replace('$', '', regex=False).str.replace(',', '.', regex=False).astype(float)

In [30]:

df_limpio.rename(columns= {'monthlyincome': 'monthlyincome_$'}, inplace=True)

In [31]:
df_limpio['monthlyrate'] = df_limpio['monthlyrate'].str.replace('$', '', regex=False).str.replace(',', '.', regex=False).astype(float)

In [32]:
df_limpio.rename(columns= {'monthlyrate':'monthlyrate_$'}, inplace=True)

In [33]:
df_limpio.drop(columns=["hourlyrate"], inplace=True)

In [34]:
df_limpio.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 39 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   int64
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   object
 11  jobinvolvement            1678 non-null   int64
 12  joblevel                  1678 non-null   int64
 13  jobrole                   1678 non-null   object
 14  jobsatisfaction           1678 non-null   int64
 15  maritalstatus             1003 non-null   object
 16  monthlyincome_$           1189 non-null   float64
 17  monthlyrate_$             1678 non-null   float64
 18  numcompaniesworked        1678 non-null   int64
 19  over18                    740 non-null    object
 20  overtime                  982 non-null    object
 21  percentsalaryhike         1678 non-null   int64
 22  performancerating         1478 non-null   object
 23  relationshipsatisfaction  1678 non-null   int64
 24  standardhours             1327 non-null   object
 25  stockoptionlevel          1678 non-null   int64
 26  totalworkingyears         1129 non-null   object
 27  trainingtimeslastyear     1678 non-null   int64
 28  worklifebalance           1564 non-null   object
 29  yearsatcompany            1678 non-null   int64
 30  yearsincurrentrole        35 non-null     object
 31  yearssincelastpromotion   1678 non-null   int64
 32  yearswithcurrmanager      1678 non-null   int64
 33  sameasmonthlyincome       1189 non-null   object
 34  datebirth                 1678 non-null   int64
 35  salary                    1393 non-null   object
 36  roledepartament           312 non-null    object
 37  numberchildren            0 non-null      float64
 38  remotework                1678 non-null   object
dtypes: float64(4), int64(17), object(18)
memory usage: 524.4+ KB

Columnas Ana

In [35]:
# borrar la columna 'over 18' ('redundante')
df_limpio.drop(columns=["over18"], inplace=True)

In [36]:
# borrar la columna 'totalworkingyears' (ya existe 'yearsatacompany')
df_limpio.drop(columns=["totalworkingyears"], inplace=True)

In [37]:
# 'worklifebalance' cambiar de objeto a numeric  
df_limpio["worklifebalance"] = pd.to_numeric(df_limpio["worklifebalance"], errors="coerce")

In [38]:
# 'performancerating' cambiar de objeto a numeric  
df_limpio["performancerating"] = pd.to_numeric(df_limpio["performancerating"], errors="coerce")

In [39]:
# gestion nulos de 'standardhours' 
df_limpio['standardhours'] = df_limpio['standardhours'].fillna("Unknown")

In [40]:
# gestion nulos de 'overtime'
df_limpio['overtime'] = df_limpio['overtime'].fillna("Unknown")

In [41]:
df_limpio.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 37 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   int64
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   object
 11  jobinvolvement            1678 non-null   int64
 12  joblevel                  1678 non-null   int64
 13  jobrole                   1678 non-null   object
 14  jobsatisfaction           1678 non-null   int64
 15  maritalstatus             1003 non-null   object
 16  monthlyincome_$           1189 non-null   float64
 17  monthlyrate_$             1678 non-null   float64
 18  numcompaniesworked        1678 non-null   int64
 19  overtime                  1678 non-null   object
 20  percentsalaryhike         1678 non-null   int64
 21  performancerating         0 non-null      float64
 22  relationshipsatisfaction  1678 non-null   int64
 23  standardhours             1678 non-null   object
 24  stockoptionlevel          1678 non-null   int64
 25  trainingtimeslastyear     1678 non-null   int64
 26  worklifebalance           0 non-null      float64
 27  yearsatcompany            1678 non-null   int64
 28  yearsincurrentrole        35 non-null     object
 29  yearssincelastpromotion   1678 non-null   int64
 30  yearswithcurrmanager      1678 non-null   int64
 31  sameasmonthlyincome       1189 non-null   object
 32  datebirth                 1678 non-null   int64
 33  salary                    1393 non-null   object
 34  roledepartament           312 non-null    object
 35  numberchildren            0 non-null      float64
 36  remotework                1678 non-null   object
dtypes: float64(6), int64(17), object(14)
memory usage: 498.2+ KB

Columnas Carmen

In [42]:
if 'numberchildren' in df_limpio.columns:
    df_limpio.drop('numberchildren', axis=1, inplace=True)
    print("'numberchildren' ha sido eliminada.")
else:
    print("'numberchildren' no se encontró en el DataFrame.")

'numberchildren' ha sido eliminada.

In [43]:
df_limpio.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'jobinvolvement', 'joblevel',
       'jobrole', 'jobsatisfaction', 'maritalstatus', 'monthlyincome_$',
       'monthlyrate_$', 'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

In [44]:
print("\nLimpiando 'yearsincurrentrole'...")
df_limpio['yearsincurrentrole'] = df_limpio['yearsincurrentrole'].str.replace(',', '.', regex=False).astype(float)
print("'yearsincurrentrole' convertida a tipo numérico (float).")

Limpiando 'yearsincurrentrole'...
'yearsincurrentrole' convertida a tipo numérico (float).

In [45]:
df_limpio['salary'] = df_limpio['salary'].str.replace('$', '', regex=False).str.replace(',', '.', regex=False).astype(float)

In [46]:
salario = df_limpio['sameasmonthlyincome'] == df_limpio['monthlyincome_$']

In [47]:
salario.head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [48]:
df_income = df_limpio[['monthlyincome_$', "sameasmonthlyincome", 'salary']]
df_income
#estudiar cómo sacar info de salary para monthlyincome

      monthlyincome_$ sameasmonthlyincome     salary
0            16280.83           16280,83$  195370.00
1                 NaN                 NaN  199990.00
2                 NaN                 NaN  192320.00
3            14307.50           14307,50$  171690.00
4            12783.92           12783,92$        NaN
...               ...                 ...        ...
1673          3949.17            3949,17$        NaN
1674         15943.72           15943,72$  191324.62
1675              NaN                 NaN   28111.13
1676          8339.32            8339,32$  100071.84
1677              NaN                 NaN   53914.11

[1678 rows x 3 columns]

In [49]:
df_limpio['roledepartament'] = df_limpio['roledepartament'].str.strip().str.lower()

In [50]:
df_limpio['roledepartament'].unique()

array([nan, 'manager  -  research & development',
       'healthcare representative  -  research & development',
       'sales executive  -  sales',
       'laboratory technician  -  research & development',
       'manufacturing director  -  research & development',
       'research scientist  -  research & development',
       'research director  -  research & development',
       'human resources  -  human resources', 'manager  -  sales',
       'sales representative  -  sales', 'manager  -  human resources'],
      dtype=object)

In [51]:
df_limpio['remotework'].unique()

array(['Yes', '1', 'False', '0', 'True'], dtype=object)

In [52]:
mapa_booleano = {
    'Yes': True, '1': True, 1: True, 'True': True, True: True,
    'False': False, '0': False, 0: False, 'No': False, False: False
}

In [53]:
df_limpio['remotework'] = df_limpio['remotework'].map(mapa_booleano).astype(bool)

In [54]:
df_limpio.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 36 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   int64
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   object
 11  jobinvolvement            1678 non-null   int64
 12  joblevel                  1678 non-null   int64
 13  jobrole                   1678 non-null   object
 14  jobsatisfaction           1678 non-null   int64
 15  maritalstatus             1003 non-null   object
 16  monthlyincome_$           1189 non-null   float64
 17  monthlyrate_$             1678 non-null   float64
 18  numcompaniesworked        1678 non-null   int64
 19  overtime                  1678 non-null   object
 20  percentsalaryhike         1678 non-null   int64
 21  performancerating         0 non-null      float64
 22  relationshipsatisfaction  1678 non-null   int64
 23  standardhours             1678 non-null   object
 24  stockoptionlevel          1678 non-null   int64
 25  trainingtimeslastyear     1678 non-null   int64
 26  worklifebalance           0 non-null      float64
 27  yearsatcompany            1678 non-null   int64
 28  yearsincurrentrole        35 non-null     float64
 29  yearssincelastpromotion   1678 non-null   int64
 30  yearswithcurrmanager      1678 non-null   int64
 31  sameasmonthlyincome       1189 non-null   object
 32  datebirth                 1678 non-null   int64
 33  salary                    1393 non-null   float64
 34  roledepartament           312 non-null    object
 35  remotework                1678 non-null   bool
dtypes: bool(1), float64(7), int64(17), object(11)
memory usage: 473.6+ KB

###
- Continuación Carmen

In [55]:
# Conversión
cols = ['yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion', 'yearswithcurrmanager']
df_limpio[cols] = df_limpio[cols].apply(pd.to_numeric, errors='coerce')

# Opcional: revisión de inconsistencias
df_limpio[df_limpio['yearswithcurrmanager'] > df_limpio['yearsatcompany']]

Empty DataFrame
Columns: [age, attrition, businesstravel, dailyrate, department, distancefromhome, education, educationfield, employeenumber, environmentsatisfaction, gender, jobinvolvement, joblevel, jobrole, jobsatisfaction, maritalstatus, monthlyincome_$, monthlyrate_$, numcompaniesworked, overtime, percentsalaryhike, performancerating, relationshipsatisfaction, standardhours, stockoptionlevel, trainingtimeslastyear, worklifebalance, yearsatcompany, yearsincurrentrole, yearssincelastpromotion, yearswithcurrmanager, sameasmonthlyincome, datebirth, salary, roledepartament, remotework]
Index: []

In [56]:
df_limpio[cols]

,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager
0,20,NaN,15,15
1,33,NaN,11,9
2,22,NaN,11,15
3,20,NaN,5,6
4,19,NaN,2,8
...,...,...,...,...
1673,3,NaN,1,2
1674,5,NaN,1,0
1675,6,NaN,1,5
1676,22,NaN,14,10
1677,8,NaN,0,7

In [57]:
# Si quieres mantenerlo y estandarizarlo:
df_limpio['sameasmonthlyincome'] = df_limpio['sameasmonthlyincome'].str.replace('.', '', regex=False)\
                                                      .str.replace(',', '.', regex=False)\
                                                      .str.replace('$', '', regex=False)
df_limpio['sameasmonthlyincome'] = pd.to_numeric(df_limpio['sameasmonthlyincome'], errors='coerce')

# Luego compara
(df_limpio['sameasmonthlyincome'] == df_limpio['monthlyincome_$']).value_counts()

'''# Alternativa más simple: elimina la columna si es redundante
df_limpio.drop(columns='sameasmonthlyincome', inplace=True)'''

"# Alternativa más simple: elimina la columna si es redundante\ndf_limpio.drop(columns='sameasmonthlyincome', inplace=True)"

In [58]:
df_limpio_c = df_limpio [['yearsatcompany', 'yearsincurrentrole',
       'yearssincelastpromotion', 'yearswithcurrmanager',
       'sameasmonthlyincome', 'datebirth', 'salary', 'roledepartament',
       'remotework']]

df_limpio_c

,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,remotework
0,20,NaN,15,15,16280.83,1972,195370.00,NaN,True
1,33,NaN,11,9,NaN,1971,199990.00,NaN,True
2,22,NaN,11,15,NaN,1981,192320.00,manager - research & development,True
3,20,NaN,5,6,14307.50,1976,171690.00,NaN,False
4,19,NaN,2,8,12783.92,1977,NaN,NaN,False
...,...,...,...,...,...,...,...,...,...
1673,3,NaN,1,2,3949.17,1980,NaN,NaN,True
1674,5,NaN,1,0,15943.72,1976,191324.62,NaN,False
1675,6,NaN,1,5,NaN,1994,28111.13,NaN,False
1676,22,NaN,14,10,8339.32,1976,100071.84,NaN,True
1677,8,NaN,0,7,NaN,1991,53914.11,NaN,False

In [59]:
print(f"Valores faltantes en 'yearsincurrentrole' ANTES: {df_limpio['yearsincurrentrole'].isnull().sum()}")

# --- PASO 3: Imputar (rellenar) los valores faltantes ---
# Usamos el método .fillna() para rellenar los NaN de 'yearsincurrentrole'
# con los valores correspondientes de la columna 'yearssincelastpromotion'.
# 'inplace=True' modifica el DataFrame directamente.
df_limpio['yearsincurrentrole'].fillna(df_limpio['yearssincelastpromotion'], inplace=True)

# --- PASO 4: Verificar el resultado ---
# Ahora la columna debería estar completa.
print(f"Valores faltantes en 'yearsincurrentrole' DESPUÉS: {df_limpio['yearsincurrentrole'].isnull().sum()}")

# Opcional: Mostrar las primeras filas para ver el cambio
print("\nVista previa de las columnas después de la imputación:")
print(df_limpio[['yearsatcompany', 'yearssincelastpromotion', 'yearsincurrentrole']].head(20))

Valores faltantes en 'yearsincurrentrole' ANTES: 1643
Valores faltantes en 'yearsincurrentrole' DESPUÉS: 0

Vista previa de las columnas después de la imputación:
    yearsatcompany  yearssincelastpromotion  yearsincurrentrole
0               20                       15                15.0
1               33                       11                11.0
2               22                       11                11.0
3               20                        5                 5.0
4               19                        2                 2.0
5               22                        4                 4.0
6               21                        7                 7.0
7               20                       11                11.0
8               18                       11                11.0
9               18                        0                 0.0
10              21                        5                 5.0
11              19                       15                15.0
12              18                        1                 1.0
13              22                       15                15.0
14              24                        2                 2.0
15              20                        1                 1.0
16              31                       13                13.0
17              26                       15                15.0
18              16                        1                 1.0
19              18                       14                14.0

/tmp/ipykernel_1535035/2103246837.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_limpio['yearsincurrentrole'].fillna(df_limpio['yearssincelastpromotion'], inplace=True)

In [60]:
columnas_numericas = df_limpio.select_dtypes(include=['number'])
estadisticas_descriptivas = columnas_numericas.describe()
print("\nEstadísticas descriptivas de las columnas numéricas:")
estadisticas_descriptivas

Estadísticas descriptivas de las columnas numéricas:

,age,dailyrate,distancefromhome,education,employeenumber,environmentsatisfaction,jobinvolvement,joblevel,jobsatisfaction,monthlyincome_$,monthlyrate_$,numcompaniesworked,percentsalaryhike,performancerating,relationshipsatisfaction,stockoptionlevel,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary
count,1678.000000,1678.000000,1678.000000,1678.000000,1678.000000,1678.000000,1678.000000,1678.000000,1678.000000,1189.000000,1678.000000,1678.000000,1678.000000,0.0,1678.000000,1678.000000,1678.000000,0.0,1678.000000,1678.000000,1678.000000,1678.000000,1189.000000,1678.000000,1393.000000
mean,38.952920,668.079714,11.184744,2.932658,809.859952,2.695471,2.740763,2.064362,2.743147,5676.787065,14029.674648,2.670441,15.154350,NaN,2.700238,0.787843,2.795590,NaN,7.124553,2.269964,2.241955,4.200238,5676.787065,1986.047080,65070.911587
std,9.154908,470.787298,10.479008,1.024270,467.084867,1.107083,0.710359,1.099425,1.105172,6157.859086,9886.532728,2.501133,3.649607,NaN,1.079494,0.843252,1.288657,NaN,6.173837,3.254711,3.246554,3.554224,6157.859086,9.154908,45849.510802
min,20.000000,104.103175,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1000.000000,2186.170000,0.000000,11.000000,NaN,1.000000,0.000000,0.000000,NaN,0.000000,0.000000,0.000000,0.000000,1000.000000,1963.000000,10090.000000
25%,32.000000,290.035510,2.000000,2.000000,403.250000,2.000000,2.000000,1.000000,2.000000,2342.590000,6090.750000,1.000000,12.000000,NaN,2.000000,0.000000,2.000000,NaN,3.000000,0.000000,0.000000,2.000000,2342.590000,1980.000000,28111.130000
50%,38.000000,556.256661,8.000000,3.000000,813.500000,3.000000,3.000000,2.000000,3.000000,4492.840000,11681.390000,2.000000,14.000000,NaN,3.000000,1.000000,3.000000,NaN,5.000000,1.000000,1.000000,3.000000,4492.840000,1987.000000,53914.110000
75%,45.000000,971.956349,17.000000,4.000000,1215.750000,4.000000,3.000000,3.000000,4.000000,7861.670000,20411.080000,4.000000,18.000000,NaN,4.000000,1.000000,3.000000,NaN,9.000000,3.000000,3.000000,7.000000,7861.670000,1993.000000,94390.000000
max,62.000000,2063.388889,49.000000,5.000000,1614.000000,4.000000,4.000000,5.000000,4.000000,94083.000000,43331.170000,9.000000,25.000000,NaN,4.000000,3.000000,6.000000,NaN,40.000000,15.000000,15.000000,17.000000,94083.000000,2005.000000,199990.000000

In [61]:
columnas_numericas.isnull().sum()

age                            0
dailyrate                      0
distancefromhome               0
education                      0
employeenumber                 0
environmentsatisfaction        0
jobinvolvement                 0
joblevel                       0
jobsatisfaction                0
monthlyincome_$              489
monthlyrate_$                  0
numcompaniesworked             0
percentsalaryhike              0
performancerating           1678
relationshipsatisfaction       0
stockoptionlevel               0
trainingtimeslastyear          0
worklifebalance             1678
yearsatcompany                 0
yearsincurrentrole             0
yearssincelastpromotion        0
yearswithcurrmanager           0
sameasmonthlyincome          489
datebirth                      0
salary                       285
dtype: int64

In [62]:
df_limpio.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'jobinvolvement', 'joblevel',
       'jobrole', 'jobsatisfaction', 'maritalstatus', 'monthlyincome_$',
       'monthlyrate_$', 'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

In [63]:
test_salary = df_limpio["monthlyincome_$"]*12
test_salary

0       195369.96
1             NaN
2             NaN
3       171690.00
4       153407.04
          ...
1673     47390.04
1674    191324.64
1675          NaN
1676    100071.84
1677          NaN
Name: monthlyincome_$, Length: 1678, dtype: float64

In [64]:
# Columnas a convertir
cols_to_numeric = ['salary', 'monthlyincome_$', 'sameasmonthlyincome']

# Imprimir el estado inicial
print("Valores faltantes ANTES de la limpieza:")
print(df_limpio[cols_to_numeric].isnull().sum())

# Convertir a numérico
for col in cols_to_numeric:
    df_limpio[col] = pd.to_numeric(df_limpio[col], errors='coerce')

# Verificar si 'monthlyincome' y 'sameasmonthlyincome' son idénticas
# El método .equals() es perfecto para esto, ya que compara los valores y los NaN
if df_limpio['monthlyincome_$'].equals(df_limpio['sameasmonthlyincome']):
    print("\nConfirmado: 'sameasmonthlyincome' es una copia exacta de 'monthlyincome_$'.")
    # Eliminamos la columna redundante
    df_limpio.drop(columns=['sameasmonthlyincome'], inplace=True)
    print("Columna 'sameasmonthlyincome' eliminada.")
else:
    print("\n'sameasmonthlyincome' no es una copia exacta de 'monthlyincome'. Se recomienda investigar más a fondo.")

# Imprimir el estado después de la limpieza y eliminación
print("\nValores faltantes DESPUÉS de la limpieza:")
print(df_limpio[['salary', 'monthlyincome_$']].isnull().sum())

Valores faltantes ANTES de la limpieza:
salary                 285
monthlyincome_$        489
sameasmonthlyincome    489
dtype: int64

Confirmado: 'sameasmonthlyincome' es una copia exacta de 'monthlyincome_$'.
Columna 'sameasmonthlyincome' eliminada.

Valores faltantes DESPUÉS de la limpieza:
salary             285
monthlyincome_$    489
dtype: int64

In [65]:
# Rellenar 'salary' usando 'monthlyincome'
df_limpio['salary'].fillna(df_limpio['monthlyincome_$'] * 12, inplace=True)

/tmp/ipykernel_1535035/4150488881.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_limpio['salary'].fillna(df_limpio['monthlyincome_$'] * 12, inplace=True)

In [66]:
df_income = df_limpio[['monthlyincome_$', 'salary', 'dailyrate']]
df_income

      monthlyincome_$     salary    dailyrate
0            16280.83  195370.00  2015.722222
1                 NaN  199990.00  2063.388889
2                 NaN  192320.00  1984.253968
3            14307.50  171690.00  1771.404762
4            12783.92  153407.04  1582.771346
...               ...        ...          ...
1673          3949.17   47390.04   488.944444
1674         15943.72  191324.62  1973.984127
1675              NaN   28111.13   290.035510
1676          8339.32  100071.84  1032.487286
1677              NaN   53914.11   556.256661

[1678 rows x 3 columns]

In [67]:
df_limpio['salary'].isna().sum()

0

In [ ]:
'''
# Rellenar 'monthlyincome' usando 'salary'
df_carmen['monthlyincome'].fillna(df_carmen['salary'] / 12, inplace=True)

print("\nValores faltantes después de la imputación cruzada:")
print(df_carmen[['salary', 'monthlyincome']].isnull().sum())
'''

In [ ]:
'''# Comprobamos si aún quedan nulos
if df_carmen['monthlyincome'].isnull().any():
    print("\nAún quedan valores nulos. Usando 'dailyrate' para rellenarlos.")
    
    # Rellenar 'monthlyincome' usando 'dailyrate'
    # Asumimos 20 días laborables por mes. Es una aproximación, pero es mejor que nada.
    df_carmen['monthlyincome'].fillna(df_carmen['dailyrate'] * 20, inplace=True)
    
    # Volvemos a rellenar 'salary' con los nuevos valores de 'monthlyincome'
    df_carmen['salary'].fillna(df_carmen['monthlyincome'] * 12, inplace=True)

print("\nValores faltantes al FINAL del proceso:")
print(df_carmen[['salary', 'monthlyincome']].isnull().sum())

# Mostramos una vista previa del resultado
print("\nVista previa de los datos imputados:")
print(df_carmen[['salary', 'monthlyincome', 'dailyrate']].head())'''